//инициализация таймера №2
//таймер 32х битный
//default frequence 24*10^6 24 мегагерц
#include "stm32f407xx.h"
#include "stm32f4xx.h"

uint8_t ii = 0; //Переменная отображает текущее состояние светодиода - ON/OFF

void Tim_2_ini(void){
	NVIC_SetPriority(TIM2_IRQn, 2); //Приоритет прерывания
  NVIC_EnableIRQ(TIM2_IRQn); //Разрешаем обработку прерывания от таймера 2
	RCC->APB1ENR |= RCC_APB1ENR_TIM2EN; //Подаем тактовые импульсы на таймер 2
	//prescaller
	TIM2->PSC=24000-1;//Коэффициент деления 24000 получаем раз в милисекунду
	//auto reload устанавливаем предел до которого тикает таймер
	TIM2->ARR=300;//Перезагружаемое значение 
	TIM2->DIER |=TIM_DIER_UIE;//Разрешаем прерывание при переполнении счетчика
	TIM2->CR1 |=TIM_CR1_CEN;//начать отсчёт
	
}
void TIM2_IRQHandler(void) //Функция обработчика прерывания от таймера 2
  {
    TIM2->SR &= ~TIM_SR_UIF; //Сбрасываем бит вызова прерывания. 
    if (ii == 0) //Проверяем текущее состояние светодиода - ON/OFF
      GPIOD->BSRR |= GPIO_BSRR_BS_14; //Зажигаем светодиод
    else
     GPIOD->BSRR |= GPIO_BSRR_BR_14; //Или гасим светодиод
    ii = ~ii; //Изменяем переменную, отображающую текушее состояние светодиода
}
